import {IPost} from '../interfaces/post.model';

export const FAKE_POSTS_LIST: IPost[] = [
  {
    id: 1,
    category: 'inteview',
    img: 'https://s.dou.ua/storage-files/image4_n32Jh7r.jpg',
    title: 'Network Engineer — про специфіку професії, IT-освіту в Польщі зі штрафами за перездачі та роботу в старовинному монастирі',
    description: 'Мережевий інженер Євген Цимбалюк мав мрію — здобути європейську освіту. Для цього він півтора року заощаджував кошти та самостійно вчив польську мову. У статті Євген розповів про те, як вдалося отримати бажане, про специфіку професії Network Engineer, а також про те, як працював в одному з найстаріших монастирів Європи.',
    content: 'На другому курсі Національного авіаційного університету за спеціальністю «Безпека інформаційно-комунікаційних систем» ми вивчали предмет з мережевих технологій. Тоді мене настільки зацікавили мережі, що 2011 року я пішов на двотижневі курси з ССNA від «Укртелекому». Це коштувало не дуже дорого — 4 тисячі гривень. Я вважаю, що якщо хочеш швидко освоїти професію, то курси — найліпший варіант. Є з ким порадитися, поставити запитання, коли щось не зрозумів. Втім багато моїх колег починали із сапорту, а під час роботи здобували знання, дивилися лекції на ютубі й переходили працювати в технічну частину.\n' +
      '\n' +
      'Закінчивши курси, я одразу влаштувався до невеликого бориспільського провайдера на підтримку клієнтів із зарплатою 400 доларів на місяць. Водночас мав і адмініструвати мережу. У мене було багато різних завдань, зокрема розгортати сервіси на Linux. Чимало гуглив і радився з колегами. За рік сильно прокачав свої навички.\n' +
      '\n' +
      'Мережевий інженер повинен добре знати ОС Windows, Linux, віртуалізацію, маршрутизацію і комутацію, мережеві сервіси, які треба налагоджувати, щоб мережа працювала безперебійно. Для роботи на IT-компанію потрібні ще базові знання з безпеки, вміти налаштовувати фаєрволи, щоб захищати локальні мережі від зовнішніх атак. На всіх місцях роботи я мав добре знати і Linux, і віртуалізацію VMware, те, на чому розуміються сисадміни.\n' +
      '\n' +
      'Системні адміністратори підтримують правильну роботу комп’ютерної техніки та програмного забезпечення, а також відповідають за інформаційну безпеку організації. Вони віртуалізують сервери, повинні тямити в маршрутизації, поглиблено знати ОС Linux і Windows. Також сисадміни використовують технологію Active Directory для зберігання та організації об’єктів у мережі. Основна різниця між цими спеціальностями полягає в тому, що проблеми мережевого рівня вирішує Network Engineer, а серверного — системний адміністратор.\n' +
      '\n' +
      'В IT-компанії зазвичай запрошують більш скілових Network Engineers, коли потрібно правильно розробити дизайн нової мережі чи модернізувати стару. Провайдери ж переважно наймають людей, щоб підтримувати вже налагоджену мережу. У них теж бувають модернізації, але лише часткові. Крім того, Network Engineer працює безпосередньо з обладнанням: встановлює та налаштовує нове, ремонтує і замінює те, що вийшло з ладу.\n' +
      '\n' +
      'Кілька років тому в інтернеті почалися суперечки про те, що з появою хмарних сервісів потреба в мережевих інженерах може поступово зникнути. Та, на мою думку, будь-які компанії, особливо великі бізнеси, потребують побудови корпоративних мереж. Так, на сайті Rabota.ua нині шукають 148 таких фахівців, понад 100 з яких у Києві. Переважно мережевих інженерів наймають великі бізнеси, а не IT-компанії, тому на DOU таких вакансій небагато (13 на момент публікації — ред.). Хоча час від часу мені писали і з таких відомих IT-компаній, як GlobalLogic і Ciklum, що теж пропонують мережеві рішення, але вже на міжнародний рівень. З розвитком хмарних сервісів розгортанням мережі можуть займатися й системні адміністратори. Вони надають Cloud-рішення, однак усі провайдери й далі шукають мережевих інженерів у свої команди.\n' +
      '\n' +
      'Усі сфери життя настільки просякнуті інтернетом, що мені здається, люди вже не зможуть жити без нього. Мене повністю влаштовує моя професія, і я не збираюся її змінювати найближчим часом.\n' +
      '\n' +
      'Дитяча мрія: «Вітчим сказав: якщо будеш гарно навчатися в школі, вступиш до Гарварду»\n' +
      'Через рік роботи у провайдера я знайшов інше місце. Потрібно було реалізовувати Wi-Fi — рішення в різних ресторанах і пабах Києва. Платили 600 доларів на місяць. Це була позмінна робота — доба на роботі, три — вдома. Річ у тім, що розважальні заклади працюють допізна, часто до 5-ї ранку, через що мережеві інженери мають бути доступні 24/7 у режимі чергування, бо ніколи не знаєш, коли можуть виникнути проблеми.\n' +
      '\n' +
      'У мене була мрія — здобути європейську освіту. Нам з сестрою цю думку заклав ще у ранньому дитинстві вітчим. Тоді він розповідав, що потрібно неодмінно гарно навчатися в школі, щоб потім вступити до Гарварду. Це була радше казочка для дітей, але з прицілом на майбутнє. Мета полягала в тому, щоб потім жити й працювати в Європі.\n' +
      '\n' +
      'Рідні планували фінансово допомогти зі вступом у виш, та життя склалося інакше. Спочатку я працював складачем поїздів на станції Київ-Пасажирський. Після кризи 2008 року, коли долар обвалився, вирішив спробувати себе в IT. У 2010 році вступив на заочну форму навчання до НАУ. А 2011-го взяв на роботі лікарняний на два тижні, щоб піти на курси. Мій начальник помітив, що я, м’яко кажучи, недопрацьовую, займаюся чимось на стороні, й попросив обрати: або працювати повноцінно далі, або піти. Так я звільнився. Паралельно почав підшукувати навчальний заклад у Європі.'
  },
  {
    id: 2,
    category: 'inteview',
    img: 'https://s.dou.ua/storage-files/IT_Park_Helicopter_view_54gmwYk.jpg',
    title: 'IT Park у Львові залучив €81,5 млн кредиту. Коли його побудують і що зараз із проєктом — розповідає Степан Веселовський, CEO Lviv IT Cluster',
    description: 'Будівництво IT Park у Львові на 10 000 спеціалістів мали почати 2019 року, але через ситуацію з ковідом усе пішло не за планом. Нині завдяки кредиту у 81,5 млн євро від польського банку є всі шанси його відновити. Ми поспілкувалися зі Степаном Веселовським, СЕО Львівського IT Кластеру та одним з ініціаторів IT Парку, про те, як проєкт розвивався за ці роки, чи були в ньому зміни та коли почнеться будівництво. ',
    content: 'Ідея створення IT Парку довго крутилася в нашій IT- та бізнес-тусовці, але не було інвестора та команди, яка була б здатна реалізувати проєкт. Ми, Львівський IT Кластер, стали ініціатором проєкту й почали з того, що замовили дослідження, яке показало, а чи справді для нього є місце на ринку. Інвестиції тут потрібні великі, і необхідно було зрозуміти, чи є потенційний інтерес в інвесторів. У межах дослідження було опитано близько 35 компаній і з’ясувалося, що є велике зацікавлення з боку IT-індустрії. Крім того, завдяки цьому ми змогли сформувати концепцію парку на основі очікувань компаній.\n' +
      '\n' +
      'У 2017 році на нашій щорічній конференції IT Jazz, яку завжди відвідують інвестори, ми презентували цю концепцію і знайшли першу зацікавлену сторону — інвестора, партнера проєкту — компанію Galereja Centre. Це львівська інвестиційно-девелоперська компанія. В них була схожа ідея, але вони не знали, як реалізувати проєкт так, щоб він задовольняв потреби людей. Після конференції ми ще провели декілька зустрічей, домовилися про співпрацю, розподілили функції. І тоді почався активний пошук інвесторів, щоб закрити потребу в коштах. Одного інвестора було недостатньо, адже масштаб проєкту виявився навіть більшим, ніж ми самі очікували на початку.\n' +
      '\n' +
      'Протягом року чи навіть півтора провели десятки перемовин з різними інвестиційними фондами, були залучені додаткові інвестори. На жаль, не можу називати їхні імена. Це великий канадський інвестиційно-девелоперський фонд і ще одна міжнародна інвестиційна компанія (Brookfield та Horizon Capital — ред.). Вони підтвердили свою участь у проєкті, і у 2019 році ми зробили groundbreaking ceremony — офіційне представлення інвесторів і публічне підтвердження намірів, що проєкт буде реалізовано. Водночас почався процес перемовин з IT-компаніями, які стали б резидентами парку.\n' +
      '\n' +
      'Проблема була в тому, що ми недооцінили час, відведений на перемовини. Часу знадобилося більше, оскільки йшлося про контракти між інвесторами та ключовими резидентами майже на 90 млн доларів. Затримки виникали, бо було багато нюансів: усі ці компанії міжнародні, центри ухвалення рішень розташовані не тільки в Україні, було погодження на багатьох рівнях з обох сторін.\n' +
      '\n' +
      'У результаті 5 IT-компаній (GlobalLogic, N-iX, Intellias, SoftServe та Perfectial — ред.) у 2019 році підписали офіційні контракти. Передбачалося, що вони орендують близько 50 тис. квадратних метрів офісної площі, тобто більшу частину парку. І було великою перемогою для всіх те, що це відбулося на такому ранньому етапі. Але це зайняло більше часу, ніж ми очікували.'
  },
  {
    id: 3,
    category: 'updates',
    img: 'https://s.mind.ua/img/forall/a/202240/90.jpg?1617182707',
    title: 'Японський конгломерат Hitachi купує ІТ-компанію GlobalLogic, у якої майже 6 тисяч спеціалістів в Україні',
    description: 'Японський конгломерат Hitachi, Ltd сьогодні оголосив про свій план придбати компанію GlobalLogic Inc з офісами в Україні за $9,6 млрд. Процес передачі планують завершити до кінця липня 2021 року. Очікується, що угода стане найбільшим придбанням Hitachi.',
    content: 'Японський конгломерат Hitachi, Ltd сьогодні оголосив про свій план придбати компанію GlobalLogic Inc за $9,6 млрд, повідомляє Nikkei Asia. Угода укладена між Hitachi Global Digital Holdings Corporation та GlobalLogic Worldwide Holdings, Inc., материнською компанією GlobalLogic. Процес передачі планують завершити до кінця липня 2021 року. Очікується, що це стане найбільшим придбанням Hitachi.\n' +
      '\n' +
      'У конгломерат Hitachi входить понад 1100 компаній, які працюють у різних сферах від електроніки та машинобудування до фінансів і страхування.\n' +
      '\n' +
      'Завдяки цій угоді японська компанія планує посилити свою експертизу в IT-секторі та скоротити непріоритетні напрями діяльності. Toshiaki Tokunaga, віцепрезидент Hitachi, підкреслює, що, крім технологічних переваг, для них цінний досвід GlobalLogic з клієнтами поза межами Японії у сферах машинобудування та охорони здоров’я.\n' +
      '\n' +
      'Hitachi планує викупити всі акції в акціонерів GlobalLogic та передати компанію під управління Hitachi Global Digital Holdings, яка курує діяльність компанії в США.\n' +
      '\n' +
      'На фондовому ринку новини сприйняли неоднозначно — в середу ціна акцій Hitachi в Токіо впала більш ніж на 7%. Але угода вже приносить користь для Hitachi: очікується значне зростання продажів, а коефіцієнт прибутковості IT-проєктів у компанії вже становить понад 10% — більше, ніж будь-яких інших.'
  },
  {
    id: 4,
    category: 'updates',
    img: 'https://s.dou.ua/img/announces/240x_Payoneer-240.jpg',
    title: 'Що відбувається з Payoneer: збираємо апдейти',
    description: 'З 26 червня користувачі платіжних карток Payoneer втратили доступ до власних коштів. Що відбувається з платіжною системою — публікуємо хроніку подій. ',
    content: 'Тоді ж на DOU з’явився топік, що фінансовий партнер Payoneer збанкрутував (за чотири дні топік набрав майже 80 тис. переглядів). Фінансовий партнер — це німецька компанія Wirecard. Якщо коротенько, то в німецької Wirecard AG є дочірня компанія в Британії — Wirecard Card Solutions, яка випускала картки для Payoneer (і не тільки для них). Близько тижня тому Wirecard викрили в підробці звітності та завищенні фінансових показників на 1,9 млрд євро. CEO був заарештований, акції компанії обвалилися. Докладніше про ситуацію читайте на AIN.UA.\n' +
      '\n' +
      '27 і 28 червня\n' +
      'Payoneer опублікувала офіційне повідомлення щодо ситуації. Найголовніше:\n' +
      '\n' +
      'Wirecard Card Solutions Limited (WCSL) тісно співпрацює з британським регулятором Financial Conduct Authority (FCA), щоби розв’язати проблеми й можна було зняти тимчасове заморожування рахунків;\n' +
      'поки FCA не завершить розслідування, тимчасово не можна використовувати кошти на картці або отримувати нові платежі на картку;\n' +
      'кошти, що перевищують максимальний баланс вашої картки (картка вміщує до $10 000), керуються Payoneer і доступні для зняття. Вони не підпадають під заморожування;\n' +
      'усі нові платежі не підпадають під заморожування і будуть доступні для зняття.'
  },
  {
    id: 5,
    category: 'events',
    img: 'https://s.dou.ua/storage-files/8allocate.jpg',
    title: 'Як українські IT-компанії святкували Halloween 2020',
    description: 'Кожного року ми збираємо моторошні фото українських IT-шників з Геловіну. І цей рік — не виняток. Тож погляньмо, як це було. 9',
    content: 'На Хелловін традиційними були й залишаються класичні персонажі фільмів жахів: наприклад, Дракула, Франкештейн чи сімейка Адамсів. Переодягатися у лякливі образи вперше почали американські підлітки. Відтоді це стало традицією і поширилося світом.\n' +
      '\n' +
      'Люди, які не хочуть витрачати зайві кошти й час на придбання костюмів, можуть стати на ніч примарами. Для цього достатньо білої підковдри та пари ножиць для отворів для очей.\n' +
      '\n' +
      'У страхітливих образах Хелловіну переважають чорні й помаранчеві кольори – символи ночі та пекельного вогню.\n' +
      '\n' +
      'Прихильникам унікальних карнавальних костюмів на Хелловін пропонують одягатися у телезірок, персонажів з коміксів чи обирати щось з сексуальної тематики.\n' +
      '\n' +
      'Тема ж костюмів на Хелловін залишається тією ж, що й 50 років тому – нечисть, герої з надприродними силами та міфічні персонажі з переважно кельтських легенд.\n' +
      '\n' +
      '\n' +
      '\n' +
      'Детальніше читайте на УНІАН: https://www.unian.ua/lite/holidays/10715835-vse-pro-hellovin-v-ukrajini-2019-koli-svyatkuyemo-tradiciyni-kostyumi-ta-smachni-recepti.html'
  },
  {
    id: 6,
    category: 'events',
    img: 'https://s.dou.ua/storage-files/1-Kyiv_Amosova.jpg',
    title: 'День вишиванки 2019 в українських IT-компаніях',
    description: 'Кожного третього четверга у травні Україна святкує День вишиванки. Подивимось, як це було в IT-компаніях.',
    content: 'к повідомляє оргкомітет Всесвітнього дня вишиванки, 2020 рік присвячується українській родині та родоводу. У такий спосіб організатори свята прагнуть заповнити пустку в інформаційному просторі й привернути увагу українців до того, що кожен український рід є частиною кореня, з якого виростає Україна.\n' +
      '\n' +
      '«Пандемія дала можливість зупинитись та осмислити, що насправді важливо – турбота про старше покоління та виховання освіченого, гуманного наступного. Закликаємо кожного присвятити карантинний період дослідженню власного роду. Формування дерева роду – не тільки захоплива справа, це – вкрай важлива складова повернення історичної пам’яті цілого народу. Розпитайте у старших родичів про своїх пра-пра, звідки вони родом, ким були і які насправді мали прізвища. Ви відкриєте для себе багато несподіваних фактів про примусові переселення, зросійщення, участь у визвольній боротьбі, репресіях, утратах родини під час голодоморів. Разом із тим, ви відшукаєте у своїх родоводах і видатних науковців, лікарів, митців, військових – родичів, які насправді були героями свого часу», – зазначає оргкомітет.'
  }

]
